
#ifndef targetHaveDone_h
#define targetHaveDone_h
#endif /* targetHaveDone_h */
//--------已完成
/*
 数据缓存
 启动广告页 95%ok 待设计样式model
 推送功能，重要信息推送提醒；95%
 18 拷贝北仑新区时刊的证书出来 100%ok
 无网络处理  100%ok
 极光推送sdk更换 ipv6(1.7.2无需更换)100%ok
 三种样式显示 ******** 95%ok对照设计调整
 轮播 ******** 95%ok 对这设计调整

 //---0609
 每三条加一个广告 100%ok 待进一步确认需求
 首页布局  100%ok 待添加数据
 加载图片 貌似已经搞定,不变形问题(图片大图片小不同的modle?) 100%ok
 分享新闻 100%ok
  评论和评论关闭后台控制  100%ok

推送到控制器 内容沟通   **** 基本ok 小bug 后台的时候 启动应用no 前台收到通知ok kill 后启动也ok 前台别的界面不ok(只在新闻页面弹框解决) 注释掉了功能,只在kill 的时候启动通知有效
 
 二级分类动态加载       ***100%ok 待加载数据测试 全部显示的出来
 一级分类动态加载       **100%ok最后完成了拷贝storyboard 就好做了 直接加载不同的数组    基本ok
 //0610
 评论列表             ****100%ok头部标题不需要 网易也没有
//0613
 强制更新,不更新不让用和普通更新  99%ok 后台数据配置好
 友盟sdk更换 ipv6     ****** 100%ok
 轮播图片点击去新闻     ****95% 需要加载数据
 收藏刷新测试 不需要刷新100%ok了
 轮播图片点击去新闻     ****95% 需要加载数据
 返回的是导航5个 每个导航下面至少3个分类的 新闻测试 90%ok
 新闻爆料  直接加载url          100%ok
 意见反馈界面                 暂时不做 100%ok
 广告功能每三页一条  首页的classId =0 全部新闻 100%ok
 but you still need to add "remote-notification" to the list of your supported UIBackgroundModes in your Info.plist 100%ok
 无网络启动App 检测没有网络直接去显示默认的 ok
 需要更改导航的颜色 不用网易内容也是灰色的 ok
 后台返回的时间转换为几天前或者啥的格式 ok
 我的里面 ok
 iOS8 看看效果 基本 ok
 新闻内容 新闻评论的标题 不需要 100%ok
 新闻外面阅读过的保存到本地 ok
 搜索刷新 ok
 点击去广告页 ok
 新闻内容和我的没有登录直接跳到登录页面  100ok
 适配iPad ok

/*
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */