
#ifndef targetHaveDone_h
#define targetHaveDone_h
#endif /* targetHaveDone_h */
//--------已完成
/*
 数据缓存
 启动广告页 95%ok 待设计样式model
 推送功能，重要信息推送提醒；95%
 18 拷贝开发导报的证书出来 100%ok
 无网络处理  100%ok
 极光推送sdk更换 ipv6(1.7.2无需更换)
 三种样式显示 ********
 轮播 ********

 //---0609
 每三条加一个广告 98%ok 待进一步确认需求
 首页布局  98%ok 待添加数据
 加载图片 貌似已经搞定,不变形问题(图片大图片小不同的modle?) 98%ok
 分享新闻 100%ok
 上线分享需要做隐藏(没有qq 或者微信 或者微博  三个钟没有一个就把所有的影藏)
  评论和评论关闭后台控制  100%ok

推送到控制器 内容沟通   **** 基本ok 小bug 后台的时候 启动应用no 前台收到通知ok kill 后启动也ok 前台别的界面不ok(只在新闻页面弹框解决) 注释掉了功能,只在kill 的时候启动通知有效
 
 二级分类动态加载       ***90%ok 待加载数据测试 全部显示的出来
 一级分类动态加载       **95%ok最后完成了拷贝storyboard 就好做了 直接加载不同的数组    基本ok
 //0610
 评论列表             ****95%ok头部标题可选
//0613
 强制更新,不更新不让用和普通更新  99%ok 后台数据配置好
 友盟sdk更换 ipv6     ****** 100%ok
 轮播图片点击去新闻     ****95% 需要加载数据
 收藏刷新测试 不需要刷新100%ok了
 轮播图片点击去新闻     ****95% 需要加载数据
 返回的是导航5个 每个导航下面至少3个分类的 新闻测试 90%ok

/*
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */